In [18]:
import pandas as pd

In [19]:
course_name = ['data science', 'machine learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {"course_name" : course_name, 'duration' : duration})

In [5]:
data1 = pd.DataFrame({"name" : ("nitesh","ramesh","suresh"), "age": (20,21,22), "class" : "DataScience"})

In [26]:
data1

     name  age        class
0  nitesh   20  DataScience
1  ramesh   21  DataScience
2  suresh   22  DataScience

In [27]:
type(data1)

pandas.core.frame.DataFrame

In [28]:
df

        course_name  duration
0      data science         2
1  machine learning         3
2          Big Data         6
3     Data Engineer         4

In [35]:
df[1:2]

        course_name  duration
1  machine learning         3

### Loc and Iloc

### loc and iloc

Pandas library of python is very useful for the manipulation of mathematical data and is widely used in the field of machine 
learning. It comprises many methods for its proper functioning.
                                   ### loc() and iloc() are one of those methods. 
<font color = "red"> These are used in slicing data from the pandas data frame. </font>
    They help in the convenient selection of data from the data frame in pyhton. 

They are used in filtering the data according to some conditions.

### difference between loc() and iloc() in pandas DataFrame

In [37]:
#Python loc() function

The loc function is label based data selecting method which means that we have to pass the name of the row or column 
which we want to select.

The loc function is label based data selecting method which means that we have to pass the name of the row or column 
which we want to select. 
This method includes the last element of the range passed in it, unlike """ILOC""" .
loc() method can accept the boolean data unlike iloc()

In [39]:
#Ex:

SyntaxError: invalid syntax (3586093866.py, line 1)

In [42]:
df

        course_name  duration
0      data science         2
1  machine learning         3
2          Big Data         6
3     Data Engineer         4

In [46]:
df.loc[df.course_name == "Big Data"]

  course_name  duration
2    Big Data         6

In [52]:
df[(df.course_name == "Big Data") & (df.duration ==6)]

  course_name  duration
2    Big Data         6

In [53]:
df[2:5]

     course_name  duration
2       Big Data         6
3  Data Engineer         4

In [54]:
df.loc[2:5]

     course_name  duration
2       Big Data         6
3  Data Engineer         4

### iloc()

The iloc() function is an indexed based selecting method which means that we have to pass an integer index in the method
to select a specific row/column. This method does not include the last element of the range pass in it unlike loc()

In [1]:
# Ex:

In [10]:
df.iloc[[0,2]]

    course_name  duration
0  data science         2
2      Big Data         6

In [15]:
df.iloc[1:3,0:1]

        course_name
1  machine learning
2          Big Data

In [16]:
########## Q3

In [17]:
reindex = [3,0,1,2]

In [20]:
df

        course_name  duration
0      data science         2
1  machine learning         3
2          Big Data         6
3     Data Engineer         4

In [26]:
df = df.reindex(reindex)

In [27]:
df

        course_name  duration
3     Data Engineer         4
0      data science         2
1  machine learning         3
2          Big Data         6

In [28]:
#### Q4

In [32]:
df.mean(axis = 0,numeric_only=True)

duration    3.75
dtype: float64

In [36]:
df.std(numeric_only = True)

duration    1.707825
dtype: float64

In [37]:
#### Q5

In [43]:
df.loc[1:1] = "hello"

C:\Users\nitesh.sethia\AppData\Local\Temp\ipykernel_23268\291268551.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'hello' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[1:1] = "hello"

In [44]:
df

     course_name duration
3  Data Engineer        4
0   data science        2
1          hello    hello
2       Big Data        6

In [47]:
df.mean()

TypeError: Could not convert ['Data Engineerdata sciencehelloBig Data'] to numeric

In [48]:
####Q6

The Aggregate category of window functions can be of three types, namely-

Group,
Rolling, and
Expanding.

In [49]:
####Q7

In [54]:
import datetime

In [61]:
pd.Timestamp.today()

Timestamp('2024-05-14 23:51:14.296960')

In [62]:
### Q8

'%m-%d-%Y').date()

In [72]:
from datetime import datetime

In [74]:
### print("please input two dates")
dt1 = datetime.strptime(input(), '%Y-%m-%d').date()
dt2 = datetime.strptime(input(), '%Y-%m-%d').date()
print(dt2-dt1)

 2024-02-01
 2024-05-10

99 days, 0:00:00

In [75]:
######Q9